mondaugen/stm32f-profiling/src/i2s_setup.c
#include "stm32f4xx.h"
#include <stddef.h> 
#include <math.h>
#include <string.h> 
#include "i2s_setup.h" 

/* Where data to be transferred to CODEC reside */
int16_t codecDmaTxBuf[CODEC_DMA_BUF_LEN * 2]
    __attribute__((section(".small_data"),aligned(1024)));
/* Where data from CODEC reside */
int16_t codecDmaRxBuf[CODEC_DMA_BUF_LEN * 2]
    __attribute__((section(".small_data"),aligned(1024)));
/* Which half of transmit buffer we are at currently */
int16_t * volatile codecDmaTxPtr
    __attribute__((section(".small_data"))) = NULL;
/* Which half of receive buffer we are at currently */
int16_t * volatile codecDmaRxPtr
    __attribute__((section(".small_data"))) = NULL;;

#define NUM_DMA_IRQ_CHECKS 1000 
char dma_irq_order[NUM_DMA_IRQ_CHECKS];
int dma_irq_order_idx = 0;

int __attribute__((optimize("O0"))) i2s_codec_config_pins_setup(void)
{
    /* Turn on clock for GPIOB and GPIOC pins */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN | RCC_AHB1ENR_GPIOCEN;
    /* Set pins to output mode */
    GPIOB->MODER |= (1 << (10 * 2)) | (1 << (11 * 2));
    GPIOC->MODER |= (1 << (13 * 2));
    /* No pull-up or pull-down */
    GPIOB->PUPDR &= ~((3 << (10 * 2)) | (3 << (11 * 2)));
    GPIOC->PUPDR &= ~(3 << (13 * 2));
    /* set PC13 to high to enable I2S on the codec */
    GPIOC->ODR |= (1 << 13);
    /* set PB10 and PB11 to low to set word size to 16-bits and turn off
     * de-emphasis resp. */
    GPIOB->ODR &= ~((1 << 10) | (1 << 11));

    /* for debugging */
}

/* This assumes i2s is configured as master */
int __attribute__((optimize("O0"))) i2s_clock_setup(uint32_t sr)
{
    /* Disable PLLI2S */
    RCC->CR &= ((uint32_t)(~RCC_CR_PLLI2SON));

    /* PLLI2S clock used as I2S clock source */
    RCC->CFGR &= ~RCC_CFGR_I2SSRC;

    /* Configure PLLI2S */
    /* see stm32f4 reference manual, p. 894 */
    switch(sr) {
        case 44100:
            RCC->PLLI2SCFGR = (271 << 6) | (2 << 28);
            SPI3->I2SPR     = ((0x2 << 8) | 0x6); // 44.1Khz
            I2S3ext->I2SPR  = ((0x2 << 8) | 0x6);
            break;
        case 16000:
            RCC->PLLI2SCFGR = (213 << 6) | (2 << 28);
            SPI3->I2SPR     = ((0x2 << 8) | 13); // 16KHz
            I2S3ext->I2SPR  = ((0x2 << 8) | 13);
            break;
        case 32000:
            RCC->PLLI2SCFGR = (213 << 6) | (2 << 28);
            SPI3->I2SPR     = ((0x3 << 8) | 0x6); // 32Khz
            I2S3ext->I2SPR  = ((0x3 << 8) | 0x6);
            break;
        default:
            return -1; /* bad sampling rate */
    }

    /* Enable PLLI2S */
    RCC->CR |= ((uint32_t)RCC_CR_PLLI2SON);

    /* Wait till PLLI2S is ready */
    while((RCC->CR & RCC_CR_PLLI2SRDY) == 0);

    return 0;
}

/* takes desired sampling rate, throws if bad sampling rate */
int __attribute__((optimize("O0"))) i2s_dma_full_duplex_setup(uint32_t sr)
{
    /* Zero the buffers */
    memset(codecDmaTxBuf,0,sizeof(int16_t)*CODEC_DMA_BUF_LEN*2);
    memset(codecDmaRxBuf,0,sizeof(int16_t)*CODEC_DMA_BUF_LEN*2);

    /* Configure codec */
    i2s_codec_config_pins_setup();

    /* Turn on GPIO clock for I2S3 pins */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOCEN;
    /* Configure GPIO */
    /* Configure PA15 to Alternate Function */
    GPIOA->MODER &= ~(0x3 << 30);
    GPIOA->MODER |= (0x2 << 30);
    /* Configure PC7, PC10-12 to Alternate Function */
    GPIOC->MODER &= ~((0x3 << 20) | (0x3 << 22) | (0x3 << 24) | (0x3 << 14));
    GPIOC->MODER |= (0x2 << 20) | (0x2 << 22) | (0x2 << 24) | (0x2 << 14);
    /* Set pins to high speed */
    GPIOA->OSPEEDR |= (0x3 << 30);
    GPIOC->OSPEEDR |= (0x3 << 20) | (0x3 << 22) | (0x3 << 24) | (0x3 << 14);
    /* Pins have no-pull up nor pull-down */
    GPIOA->PUPDR &= ~(0x3 << 30);
    GPIOC->PUPDR &= ~((0x3 << 20) | (0x3 << 22) | (0x3 << 24) | (0x3 << 14));
    /* A15 Alternate function 6 */
    GPIOA->AFR[1] &= ~(0xf << 28);
    GPIOA->AFR[1] |= (0x6 << 28);
    /* C7 Alternate function 6 */
    GPIOC->AFR[0] &= ~(0xf << 28);
    GPIOC->AFR[0] |= (0x6 << 28);
    /* C10,12, Alternate function 6, C11 alternate function 5 */
    GPIOC->AFR[1] &= ~((0xf << 8) | (0xf << 12) | (0xf << 16));
    GPIOC->AFR[1] |= ((0x6 << 8) | (0x5 << 12) | (0x6 << 16));

    /* Turn on DMA1 clock */
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;

    /* Set up memory to peripheral DMA */
    /* Disable DMA peripheral */
    if (DMA1_Stream7->CR & DMA_SxCR_EN) {
        DMA1_Stream7->CR &= ~(DMA_SxCR_EN);
    }
    /* Wait until free */
    while (DMA1_Stream7->CR & DMA_SxCR_EN);
    /* Set peripheral address to SPI3 data register */
    DMA1_Stream7->PAR = (uint32_t)&(SPI3->DR);
    /* Set memory address to transmit buffer */
    DMA1_Stream7->M0AR = (uint32_t)codecDmaTxBuf;
    /* Inform DMA peripheral of buffer length. This is two times the defined
     * value because we trigger on HALF and FULL transfer */
    DMA1_Stream7->NDTR = (uint32_t)(CODEC_DMA_BUF_LEN * 2);
    /* Set up DMA control register: */
    /* Channel 0 */
    DMA1_Stream7->CR &= ~DMA_SxCR_CHSEL;
    /* Priority VERY HIGH */
    DMA1_Stream7->CR &= ~DMA_SxCR_PL;
    DMA1_Stream7->CR |= 0x3 << 16;
    /* PBURST one burst of 8 beats */
    DMA1_Stream7->CR &= ~DMA_SxCR_PBURST;
    DMA1_Stream7->CR |= 0x2 << 21;
    /* MBURST one burst of 8 beats */
    DMA1_Stream7->CR &= ~DMA_SxCR_MBURST;
    DMA1_Stream7->CR |= 0x2 << 23;
    /* No Double Buffer Mode (we do this ourselves with the HALF and FULL
     * transfer) */
    DMA1_Stream7->CR &= ~DMA_SxCR_DBM;
    /* Memory datum size 16-bit */
    DMA1_Stream7->CR &= ~DMA_SxCR_MSIZE;
    DMA1_Stream7->CR |= 0x1 << 13;
    /* Peripheral datum size 16-bit */
    DMA1_Stream7->CR &= ~DMA_SxCR_PSIZE;
    DMA1_Stream7->CR |= 0x1 << 11;
    /* Memory incremented after each transfer */
    DMA1_Stream7->CR |= DMA_SxCR_MINC;
    /* No peripheral address increment */
    DMA1_Stream7->CR &= ~DMA_SxCR_PINC;
    /* Circular buffer mode */
    DMA1_Stream7->CR |= DMA_SxCR_CIRC;
    /* Memory to peripheral mode (this is the transmitting peripheral) */
    DMA1_Stream7->CR &= ~DMA_SxCR_DIR;
    DMA1_Stream7->CR |= 0x1 << 6;
    /* DMA is the flow controller (DMA will keep transferring items from memory
     * to peripheral until disabled) */
    DMA1_Stream7->CR &= ~DMA_SxCR_PFCTRL;
    /* Enable interrupt on transfer complete */
    DMA1_Stream7->CR |= DMA_SxCR_TCIE;
    /* Enable interrupt on transfer half complete */
    DMA1_Stream7->CR |= DMA_SxCR_HTIE;
    /* No interrupt on transfer error */
    DMA1_Stream7->CR &= ~DMA_SxCR_TEIE;
    /* No interrupt on direct mode error */
    DMA1_Stream7->CR &= ~DMA_SxCR_DMEIE;
    
    /* Set up peripheral to memory DMA */
    /* Disable DMA peripheral */
    if (DMA1_Stream0->CR & DMA_SxCR_EN) {
        DMA1_Stream0->CR &= ~(DMA_SxCR_EN);
    }
    /* Wait until free */
    while (DMA1_Stream0->CR & DMA_SxCR_EN);
    /* Set peripheral address to I2S3_ext data register */
    DMA1_Stream0->PAR = (uint32_t)&(I2S3ext->DR);
    /* Set memory address to receive buffer */
    DMA1_Stream0->M0AR = (uint32_t)codecDmaRxBuf;
    /* Inform DMA peripheral of buffer length. This is two times the defined
     * value because we trigger on HALF and FULL transfer */
    DMA1_Stream0->NDTR = (uint32_t)(CODEC_DMA_BUF_LEN * 2);
    /* Set up DMA control register: */
    /* Channel 3 */
    DMA1_Stream0->CR &= ~DMA_SxCR_CHSEL;
    DMA1_Stream0->CR |= 0x3 << 25;
    /* Priority VERY HIGH */
    DMA1_Stream0->CR &= ~DMA_SxCR_PL;
    DMA1_Stream0->CR |= 0x3 << 16;
    /* PBURST one burst of 8 beats */
    DMA1_Stream0->CR &= ~DMA_SxCR_PBURST;
    DMA1_Stream0->CR |= 0x2 << 21;
    /* MBURST one burst of 8 beats */
    DMA1_Stream0->CR &= ~DMA_SxCR_MBURST;
    DMA1_Stream0->CR |= 0x2 << 23;
    /* No Double Buffer Mode (we do this ourselves with the HALF and FULL
     * transfer) */
    DMA1_Stream0->CR &= ~DMA_SxCR_DBM;
    /* Memory datum size 16-bit */
    DMA1_Stream0->CR &= ~DMA_SxCR_MSIZE;
    DMA1_Stream0->CR |= 0x1 << 13;
    /* Peripheral datum size 16-bit */
    DMA1_Stream0->CR &= ~DMA_SxCR_PSIZE;
    DMA1_Stream0->CR |= 0x1 << 11;
    /* Memory incremented after each transfer */
    DMA1_Stream0->CR |= DMA_SxCR_MINC;
    /* No peripheral address increment */
    DMA1_Stream0->CR &= ~DMA_SxCR_PINC;
    /* Circular buffer mode */
    DMA1_Stream0->CR |= DMA_SxCR_CIRC;
    /* Peripheral to memory mode (this is the receiving peripheral) */
    DMA1_Stream0->CR &= ~DMA_SxCR_DIR;
    /* DMA is the flow controller (DMA will keep transferring items from
     * peripheral to memory until disabled) */
    DMA1_Stream0->CR &= ~DMA_SxCR_PFCTRL;
    /* Enable interrupt on transfer complete */
    DMA1_Stream0->CR |= DMA_SxCR_TCIE;
    /* Enable interrupt on transfer half complete */
    DMA1_Stream0->CR |= DMA_SxCR_HTIE;
    /* No interrupt on transfer error */
    DMA1_Stream0->CR &= ~DMA_SxCR_TEIE;
    /* No interrupt on direct mode error */
    DMA1_Stream0->CR &= ~DMA_SxCR_DMEIE;

    /* Turn on I2S3 clock (SPI3) */
    RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
    /* set up clock dividers for desired sampling rate */
    if (i2s_clock_setup(sr)) {
        return -1;
    }
    /* CKPOL = 0, I2SMOD = 1, I2SEN = 0 (don't enable yet), I2SSTD = 00
     * (Phillips), DATLEN = 00 (16-bit), CHLEN = 0 (16-bit) I2SCFGR = 10 (Master
     * transmit) */
    SPI3->I2SCFGR = 0xa00;
    /* TXDMAEN = 1 (Transmit buffer empty DMA request enable), other bits off */
    SPI3->CR2 = SPI_CR2_TXDMAEN ;
    /* Set up duplex instance the same as SPI3, except configure as slave
     * receive and trigger interrupt when receive buffer full */
    /* same as above but I2SCFG = 01 (slave receive) */
    I2S3ext->I2SCFGR = 0x900;
    /* RXDMAEN = 1 (Receive buffer not empty DMA request enable), other bits off */
    I2S3ext->CR2 = SPI_CR2_RXDMAEN ;

    /* Enable the DMA peripherals */
   
    /* clear possible Interrupt flags */
    DMA1->HIFCR |= 0x00000f80;
    DMA1_Stream7->CR |= DMA_SxCR_EN;
    /* clear possible Interrupt flags */
    DMA1->LIFCR &= 0x0000001f;
    DMA1_Stream0->CR |= DMA_SxCR_EN;

    /* Enable DMA interrupts */
    NVIC_EnableIRQ(DMA1_Stream7_IRQn);
    NVIC_EnableIRQ(DMA1_Stream0_IRQn);

    /* Turn on I2S3 and its extended block */
    I2S3ext->I2SCFGR |= 0x400;
    SPI3->I2SCFGR |= 0x400;

    /* Wait for them to be enabled (to show they are ready) */
    while(!((DMA1_Stream7->CR & DMA_SxCR_EN) && (DMA1_Stream0->CR & DMA_SxCR_EN)));

    return 0;
}

void __attribute__((optimize("O0"))) DMA1_Stream0_IRQHandler(void)
{
    NVIC_ClearPendingIRQ(DMA1_Stream0_IRQn);
//    dma_irq_order[dma_irq_order_idx++] = 2; /* RX == 2 */
    /* if still processing, throw an error */
    /*
    if (processing) {
        HardFault_Handler();
    }
    */
    /* If transfer complete on stream 0 (peripheral to memory), set current rx
     * pointer to half of the buffer */
    if (DMA1->LISR & DMA_LISR_TCIF0) {
        /* clear flag */
        DMA1->LIFCR = DMA_LIFCR_CTCIF0;
    }
    /* If half of transfer complete on stream 0 (peripheral to memory), set current rx
     * pointer to beginning of the buffer */
    if (DMA1->LISR & DMA_LISR_HTIF0) {
        /* clear flag */
        DMA1->LIFCR = DMA_LIFCR_CHTIF0;
    }
}

void __attribute__((optimize("O0"))) DMA1_Stream7_IRQHandler(void)
{
    NVIC_ClearPendingIRQ(DMA1_Stream7_IRQn);
//    dma_irq_order[dma_irq_order_idx++] = 1; /* TX == 1 */
    /* if still processing, throw an error */
    /*
    if (processing) {
        HardFault_Handler();
    }
    */
    /* If transfer complete on stream 5 (memory to peripheral), set current tx
     * pointer to half of the buffer */
    if (DMA1->HISR & DMA_HISR_TCIF7) {
        /* clear flag */
        DMA1->HIFCR = DMA_HIFCR_CTCIF7;
        codecDmaTxPtr = codecDmaTxBuf + CODEC_DMA_BUF_LEN;
        codecDmaRxPtr = codecDmaRxBuf + CODEC_DMA_BUF_LEN;
    }
    /* If half of transfer complete on stream 5 (memory to peripheral), set current tx
     * pointer to beginning of the buffer */
    if (DMA1->HISR & DMA_HISR_HTIF7) {
        /* clear flag */
        DMA1->HIFCR = DMA_HIFCR_CHTIF7;
        codecDmaTxPtr = codecDmaTxBuf;
        codecDmaRxPtr = codecDmaRxBuf;
    }
    audio_callback(codecDmaTxPtr,codecDmaRxPtr,CODEC_DMA_BUF_LEN/CODEC_NUM_CHANNELS,
            CODEC_NUM_CHANNELS);
}
